
public class hw02 {

	public static void main(String[] args) {
		//과제2] method에 대하여 조사하여 4가지 유형을 정리하세요.
		/*
		 * 	(1) 첫번째: 리턴값이 없고, 변수도 없는 유형
		 *  -따로 값을 지정해놓고 필요할 때 출력하는 편리한 기능이다.
		 *  (2) 두번째: 리턴값이 없지만, 변수를 호출하는 유형
		 *  -매개변수가 저장될 공간이 필요하다.
		 *  (3) 세번째: 리턴값이 있고, 변수 없는 유형
		 *  -return값이 문자면 String, 숫자면 int여야 한다.
		 *  (4) 네번째: 리턴값이 있고, 변수 호출도 하는 유형
		 *  -리턴값의 변수 유형을 메서드와 맞춰주기(int형일 경우, void를 int로 변경!)
		 *  -메서드 괄호안 변수 유형과 갯수를 맞춰주기(2개일 경우 main에서 괄호안 변수값을 2개로!)
		 * 
		 */
	
		
	}

}
